app/controllers/buildings_controller.rb

SELECT  `buildings`.* FROM `buildings`  ORDER BY id ASC LIMIT 2
---
  def index
    # buildingsテーブルから最新順に建物を２件取得する
    @buildings = Building.order('id ASC').limit(2)

SELECT  `buildings`.* FROM `buildings` WHERE (building_name LIKE('%%')) LIMIT 2
---
  def search
    # 検索フォームのキーワードをあいまい検索して、buildingsテーブルから2件の建物情報を取得する
    @buildings = Building.where('building_name LIKE(?)', "%#{params[:keyword]}%").limit(2)