app/controllers/reviews_controller.rb

SELECT  `buildings`.* FROM `buildings` WHERE `buildings`.`id` = 1 LIMIT 1
---
  def new # レビュー投稿画面
    @building = Building.find(params[:building_id])

INSERT INTO `reviews` (`rate`, `review`, `building_id`, `created_at`, `updated_at`) VALUES (1, 'nicc', 1, '2016-01-28 11:44:12', '2016-01-28 11:44:12')
---
  def create # レビュー投稿機能
    Review.create(create_params) # reviews_controller.rbのcreateアクションでレビューデータを受け取り、データベースのReviewsテーブルに保存